udpate slide
